16-rails-associations/app/views/teachers/show.html.erb

SELECT "students".* FROM "students" INNER JOIN "exams" ON "students"."id" = "exams"."student_id" WHERE "exams"."teacher_id" = ?  [["teacher_id", 10]]
---
<ul>
  <% @teacher.students.each do |student| %>