16-rails-associations/app/views/students/show.html.erb

SELECT "teachers".* FROM "teachers" INNER JOIN "exams" ON "teachers"."id" = "exams"."teacher_id" WHERE "exams"."student_id" = ?  [["student_id", 13]]
---
<ul>
  <% @student.teachers.each do |teacher| %>