16-rails-associations/app/views/exams/new.html.erb

SELECT "teachers".* FROM "teachers"
SELECT "students".* FROM "students"
---
  <%= f.label :teacher_id %>
  <%= f.collection_select :teacher_id, Teacher.all, :id, :name %>
  <%= f.label :student_id %>
  <%= f.collection_select :student_id, Student.all, :id, :name %>