16-rails-associations/app/controllers/exams_controller.rb

INSERT INTO "exams" ("grade", "teacher_id", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["grade", 99], ["teacher_id", 10], ["student_id", 11], ["created_at", "2019-05-22 16:31:48.504431"], ["updated_at", "2019-05-22 16:31:48.504431"]]
---
  def create
    @exam = Exam.create(exam_params)